# Housing Market

### Introduction:

This time we will create our own dataset with fictional numbers to describe a house market. As we are going to create random data don't try to reason of the numbers.

### Step 1. Import the necessary libraries

In [50]:
import pandas as pd
import numpy as np

### Step 2. Create 3 differents Series, each of length 100, as follows: 
1. The first a random number from 1 to 4 
2. The second a random number from 1 to 3
3. The third a random number from 10,000 to 30,000

In [80]:
df1 = pd.Series(np.random.randint(1, 5, size=100))
df2 = pd.Series(np.random.randint(1, 3, size=100))
df3 = pd.Series(np.random.randint(10000, 30000, size=100))

### Step 3. Let's create a DataFrame by joinning the Series by column

In [81]:
data = pd.concat([df1, df2, df3], axis=1)

In [82]:
data.head()

   0  1      2
0  1  1  21970
1  3  2  21845
2  2  2  14283
3  1  1  11575
4  2  1  16345

In [84]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 3 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   bedrs            100 non-null    int64
 1   bathrs           100 non-null    int64
 2   price_sqr_meter  100 non-null    int64
dtypes: int64(3)
memory usage: 2.5 KB

### Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [85]:
data.columns = ['bedrs', 'bathrs', 'price_sqr_meter']

In [88]:
data.head()

   bedrs  bathrs  price_sqr_meter
0      1       1            21970
1      3       2            21845
2      2       2            14283
3      1       1            11575
4      2       1            16345

### Step 5. Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

### Step 6. Oops, it seems it is going only until index 99. Is it true?

In [89]:
bigcolumn = pd.DataFrame()

In [92]:
bigcolumn = pd.concat([df1, df2, df3])
bigcolumn.shape

(300,)

### Step 7. Reindex the DataFrame so it goes from 0 to 299

In [106]:
bigcolumn = 
bigcolumn.reset_index(drop=True)

0          1
1          3
2          2
3          1
4          2
       ...
295    11941
296    10626
297    21746
298    12098
299    16016
Length: 300, dtype: int64